[
    {"id": 1, "name": "UConvert", "desc": "UConvert is a lightweight and straightforward currency converter built to offer quick conversions in a clean, distraction-free layout.", "longdesc": "UConvert is a sleek and minimalistic currency converter built using React. It focuses on delivering a clean user experience for quickly converting amounts between two currencies. Designed with clarity in mind, it strips away unnecessary complexity and presents just the essentials: your base amount, the converted value, and the relevant currency symbols. At the moment, due to limitations with the free tier of the currency exchange API being used, live currency updates have been hardcoded to conversions between CAD and USD. This means while the app structure is fully capable of supporting real-time exchange rates for a wide range of currencies, those features are restricted to preserve functionality without hitting API request limits.", "techstack": ["React", "API Handling", "TailwindCSS", "UI/UX"], "github": "https://github.com/jeetjoshi1/UConvert", "images":[ "/projects/Uconvert.png"],  "link": "www.google.ca"},
    {"id": 2, "name": "TaskZen", "desc": "TaskZen is a lightweight URL shortener built with Node.js and MongoDB, offering fast redirects, link analytics, and a simple UI for managing and sharing links with ease", "longdesc": "TaskZen is a lightweight URL shortener built with Node.js and MongoDB, offering fast redirects, link analytics, and a simple UI for managing and sharing links with ease. It allows users to create short links that redirect to long URLs, track link performance, and manage their links easily. The application is designed to be user-friendly and efficient, making it ideal for both personal and professional use.", "techstack": ["Node.js", "Express", "React"], "github": "https://github.com/jeetjoshi1/JJ-portfolio", "images":[ "/projects/project1.png", "/projects/project1-1.png"], "link": "www.google.ca"},
    {"id": 3, "name": "QRly", "desc": "QRly is a lightweight URL shortener built with Node.js and MongoDB, offering fast redirects, link analytics, and a simple UI for managing and sharing links with ease", "longdesc": "QRly is a lightweight URL shortener built with Node.js and MongoDB, offering fast redirects, link analytics, and a simple UI for managing and sharing links with ease. It allows users to create short links that redirect to long URLs, track link performance, and manage their links easily. The application is designed to be user-friendly and efficient, making it ideal for both personal and professional use.", "techstack": ["Node.js", "MongoDB", "React"], "github": "https://github.com/jeetjoshi1/JJ-portfolio","images":[ "/projects/project1.png", "/projects/project1-1.png"],  "link": "www.google.ca"}


]